/* <\ Text reverse />

  შექმენით ტექსტარეა და ღილაკი, იუზერი რა ტექსტსაც ჩაწერს დაუბრუნეთ მაგ ტექსტის შებრუნებული მნიშვნელობა
*/

/*
  ქვემოთ უნდა დავხატოთ ქარდები და მაგ ქარდების დაახლოებითი მაგალითი (ლინკი სურათზე)
  (https://previews.123rf.com/images/luplupme/luplupme1903/luplupme190300018/124682681-farm-animals-vector-business-card-set-domestic-farming-characters-cow-sheep-goat-cattle-farmer-anima.jpg)
*/

/* <\ Zoo />

  აქ უნდა შევქმნათ ზოოპარკი, უნდა შევქმნათ ობიექტების მასივი ყოველ ობიექტში
  უნდა იყოს ცხოველი: სახელი,ასაკი,დაბადების ადგილი,პირადი ნომერი,ტელეფონის ნომერი და სურათი 3x4.
  ამ მასივს უნდა გადავუაროთ, შევქმნათ ქარდები, რომელშიც იქნება ეს ინფო ჩასეტილი;
*/


/* <\ Zoo serch/>

  აქ უნდა გავაკეთოდ ჩევი ზოოპარკის სერჩი 
  შემდეგი პარამეტრებით: სახელით, ასაკით, დაბადების ადგილით,პირადი ნომერით,ტელეფონის ნომერით;
  უნდა იყოს 5 ინპუტი რომეშიც ჩაწერს ინფოს, ამ ინფოთი გაუფილტრავთ და დაუხატავთ ახალ ქარდებს,
*/

/*
  ძალიან სახალისო დავალება გამოვა და რეალურად ბევრ რამეს ისწავლით
  როგორც ჯავასკრიპტის მხრივ ასევე ჰტმლ და ცცს-ის მხრივ.
*/
